In [5]:
#2021.06.01. TUE
#Hankyeong

#00. 패키지 호출
import numpy as np 
import pandas as pd
import seaborn as sns 

#4.1.1. 
#(1) 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다.
series_1 = pd.Series(np.random.uniform(0,10,2),index=["index_1","index_2"])
series_2 = pd.Series(np.random.uniform(0,10,2),index=["index_3","index_4"])
series_1

index_1    0.636993
index_2    4.751163
dtype: float64

In [70]:
series_2

index_3    5.814110
index_4    1.554339
dtype: float64

In [71]:
#(2) 위에서 만든 두 시리즈 객체를 이용하여 사칙 연산을 한다.
series_1+series_2

index_1   NaN
index_2   NaN
index_3   NaN
index_4   NaN
dtype: float64

In [72]:
series_1-series_2

index_1   NaN
index_2   NaN
index_3   NaN
index_4   NaN
dtype: float64

In [73]:
series_1*series_2

index_1   NaN
index_2   NaN
index_3   NaN
index_4   NaN
dtype: float64

In [74]:
series_1/series_2

index_1   NaN
index_2   NaN
index_3   NaN
index_4   NaN
dtype: float64

In [305]:
#4.1.2. 다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.
#       조건 1. 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
#       조건 2. 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.   
dataframe_1 = pd.DataFrame({"series_1" : np.random.uniform(0,10,5),
                            "series_2" : ["Hankyeong","Bigdata","Analysis","With","Python"],
                            "series_3" : np.random.uniform(0,10,5).astype(int),
                            "series_4" : np.random.uniform(0,10,5),
                            "series_5" : np.random.uniform(0,10,5)})
dataframe_1

   series_1   series_2  series_3  series_4  series_5
0  3.797201  Hankyeong         3  2.258402  4.797249
1  6.140030    Bigdata         3  8.524716  5.746143
2  1.545240   Analysis         2  6.817056  3.880505
3  2.893930       With         7  2.377844  4.819429
4  3.835131     Python         2  5.242900  8.173950

In [65]:
# 4.1.3. 다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.
#        data = {
#                "국어": [80, 90, 70, 30],
#                "영어": [90, 70, 60, 40],
#                "수학": [90, 60, 80, 70],
#                }
#        columns = ["국어", "영어", "수학"]
#        index = ["춘향", "몽룡", "향단", "방자"]
#        df = pd.DataFrame(data, index=index, columns=columns)
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)
df

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [46]:
#(1) 모든 학생의 수학 점수를 시리즈로 나타낸다.
df.loc[:,"수학"]

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [51]:
#(2) 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df_ke = df.loc[:,["국어","영어"]]
df_ke

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [52]:
#(3) 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df.loc[:,"row_mean"]=df.mean(axis=1)
df

    국어  영어  수학   row_mean
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [55]:
#(4) 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df_modify = df
df_modify.loc["방자","영어"] = 80
df_modify.loc[:,"row_mean"] = df.mean(axis=1)
df_modify

    국어  영어  수학   row_mean
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  59.166667

In [59]:
#(5) 춘향의 점수를 데이터프레임으로 나타낸다.
df.loc[["춘향"],:]

    국어  영어  수학   row_mean
춘향  80  90  90  86.666667

In [60]:
#(6) 향단의 점수를 시리즈로 나타낸다.
df.loc["향단",:]

국어          70.0
영어          60.0
수학          80.0
row_mean    70.0
Name: 향단, dtype: float64

In [213]:
#4.3.1. 모든 행과 열에 라벨을 가지는 5 x 5 이상의 크기를 가지는 데이터프레임을 만든다.
#      10가지 이상의 방법으로 특정한 행과 열을 선택한다.
dataframe_2 = pd.DataFrame({"series_1" : np.random.uniform(0,10,5),
                            "series_2" : np.random.uniform(0,10,5),
                            "series_3" : np.random.uniform(0,10,5),
                            "series_4" : np.random.uniform(0,10,5),
                            "series_5" : np.random.uniform(0,10,5)},)
dataframe_2

   series_1  series_2  series_3  series_4  series_5
0  8.232779  5.120863  1.238400  1.751302  3.936823
1  5.569104  6.485455  9.801209  2.306982  8.026181
2  7.185010  3.433266  4.524181  7.048174  8.101886
3  8.799369  6.226373  1.174997  7.176477  7.960028
4  4.960101  4.645997  8.200020  1.482483  8.579894

In [79]:
#①
dataframe_2.loc[:,"series_1"]

0    8.814344
1    9.581342
2    6.437798
3    4.848795
4    0.440379
Name: series_1, dtype: float64

In [200]:
#②
dataframe_2.loc[:,["series_1"]]

   series_1
0  5.612724
1  6.165247
2  9.638430
3  5.743043
4  3.711608

In [198]:
#③
dataframe_2.iloc[:,0]

0    5.612724
1    6.165247
2    9.638430
3    5.743043
4    3.711608
Name: series_1, dtype: float64

In [199]:
#④
dataframe_2.iloc[:,[0]]

   series_1
0  5.612724
1  6.165247
2  9.638430
3  5.743043
4  3.711608

In [201]:
#⑤
dataframe_2["series_1"]

0    5.612724
1    6.165247
2    9.638430
3    5.743043
4    3.711608
Name: series_1, dtype: float64

In [202]:
#⑤
dataframe_2[["series_1"]]

   series_1
0  5.612724
1  6.165247
2  9.638430
3  5.743043
4  3.711608

In [214]:
#⑥
dataframe_2.series_1

0    8.232779
1    5.569104
2    7.185010
3    8.799369
4    4.960101
Name: series_1, dtype: float64

In [243]:
#⑦
dataframe_2.iloc[:,0:1]

   series_1
0  8.232779
1  5.569104
2  7.185010
3  8.799369
4  4.960101

In [2]:
#⑧

In [ ]:
#⑨

In [ ]:
#⑩

In [6]:
#4.4.1. 타이타닉호 승객 데이터의 데이터 개수를 각 열마다 구해본다.
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [234]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [108]:
#4.4.2. sort_values 메서드를 사용하여 타이타닉호 승객에 대해 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class) 인원수, 사망/생존(alive) 인원수를 구하라.
titanic.loc[:,"sex"].value_counts().sort_values(ascending=False)

male      577
female    314
Name: sex, dtype: int64

In [112]:
titanic.loc[:,"age"].value_counts().sort_values(ascending=False)

24.00    30
22.00    27
18.00    26
28.00    25
19.00    25
         ..
0.67      1
20.50     1
66.00     1
24.50     1
12.00     1
Name: age, Length: 88, dtype: int32

In [113]:
titanic.loc[:,"class"].value_counts().sort_values(ascending=False)

Third     491
First     216
Second    184
Name: class, dtype: int64

In [114]:
titanic.loc[:,"alive"].value_counts().sort_values(ascending=False)

no     549
yes    342
Name: alive, dtype: int64

In [139]:
#4.4.3. 타이타닉호 승객의 데이터를 가지고 다음을 해결하시오. 
#(1) 타이타닉호 승객의 평균 나이를 구하라.
titanic.loc[:,"age"].mean(axis=0)

29.69911764705882

In [138]:
#(2) 타이타닉호 승객중 여성 승객의 평균 나이를 구하라.
titanic_female = titanic.loc[titanic.loc[:,"sex"]=="female"]
titanic_female.loc[:,"age"].mean(axis=0)

27.915708812260537

In [145]:
#(3) 타이타닉호 승객중 1등실 선실의 여성 승객의 평균 나이를 구하라.
titanic_female_1st = titanic.loc[titanic.loc[:,"sex"]=="female"].loc[titanic.loc[:,"class"]=="First"]
titanic_female_1st.loc[:,"age"].mean(axis=0)

34.61176470588235

In [253]:
#4.4.4. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category1 열을 만들어라. category1 카테고리는 다음과 같이 정의된다.
#       조건 1. 20살이 넘으면 성별을 그대로 사용한다.
#       조건 2. 20살 미만이면 성별에 관계없이 “child”라고 한다.
titanic["category_1"]=titanic.apply(lambda x : x.sex if x.age > 20 else "child", axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category_1
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male

In [15]:
#4.4.5. 타이타닉호의 승객 중 나이를 명시하지 않은 고객은 나이를 명시한 고객의 평균 나이 값이 되도록 titanic 데이터프레임을 고쳐라.
titanic_fill_age = titanic
titanic_fill_age.loc[:,"age"] = titanic.loc[:,"age"].fillna(titanic.loc[:,"age"].mean(axis=0))
titanic_fill_age.loc[:,"age"] = titanic_fill_age.loc[:,"age"].astype(int)
titanic_fill_age

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,29,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [254]:
#4.4.6. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category2 열을 만들어라. category2 카테고리는 다음과 같이 정의된다.
#       조건 1. 성별을 나타내는 문자열 male 또는 female로 시작한다.
#       조건 2. 성별을 나타내는 문자열 뒤에 나이를 나타내는 문자열이 온다.
#       예를 들어, 27살 남성은 male27 값이 된다.
titanic["category_2"]=titanic.apply(lambda x : f'{x.sex}{x.age:.0f}', axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category_1,category_2
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,male22
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,female38
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,female26
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,female35
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,male35
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,male27
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,female19
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,femalenan
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,male26
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,male32

In [25]:
#4.4.7. 타이타닉호 승객을 ‘미성년자’, ‘청년’, ‘중년’, ‘장년’, ‘노년’ 나이 그룹으로 나눈다.
#       bins = [1, 20, 30, 50, 70, 100]
#       labels = ["미성년자", "청년", "중년", "장년", "노년"]
#       그리고 각 나이 그룹의 승객 비율을 구한다. 비율의 전체 합은 1이 되어야 한다.
bins = [1, 20, 30, 50, 70, 100]
labels = ["미성년자", "청년", "중년", "장년", "노년"]
titanic_category_4 = pd.cut(titanic["age"],bins,labels=labels)
(pd.value_counts(titanic_category_4)/891).round(2).sort_index()

미성년자    0.19
청년      0.46
중년      0.27
장년      0.07
노년      0.00
Name: age, dtype: float64

In [299]:
#4.4.8. 타이타닉호의 승객에 대해 나이와 성별에 의한 카테고리 열인 category3 열을 만들어라. category3 카테고리는 다음과 같이 정의된다.
#       조건 1. 20살 미만이면 성별에 관계없이 “미성년자”라고 한다.
#       조건 2. 20살 이상이면 나이에 따라 “청년”, “중년”, “장년”, “노년”을 구분하고 그 뒤에 성별을 나타내는 “남성”, “여성”을 붙인다.
titanic_category_sex=titanic.apply(lambda x : "남성" if x.sex=="male" else "여성", axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category_1,category_2,category_3
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,male22,청년
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,female38,중년
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,female26,청년
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,female35,중년
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,male35,중년
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,male27,청년
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,female19,미성년자
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,femalenan,청년
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,male26,청년
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,male32,중년

In [310]:
for i in range(891) :
    print(titanic_category_4[i] + titanic_category_sex[i])

청년남성
중년여성
청년여성
중년여성
중년남성
청년남성
장년남성
미성년자남성
청년여성
미성년자여성
미성년자여성
장년여성
미성년자남성
중년남성
미성년자여성
장년여성
미성년자남성
청년남성
중년여성
청년여성
중년남성
중년남성
미성년자여성
청년남성
미성년자여성
중년여성
청년남성
미성년자남성
청년여성
청년남성
중년남성
청년여성
청년여성
장년남성
청년남성
중년남성
청년남성
청년남성
미성년자여성
미성년자여성
중년여성
청년여성
청년남성
미성년자여성
미성년자여성
청년남성
청년남성
청년여성
청년남성
미성년자여성
미성년자남성
청년남성
중년여성
청년여성
장년남성
청년남성
청년여성
청년남성
미성년자여성
미성년자남성
청년남성
중년여성
중년남성
미성년자남성
청년남성
청년남성
청년여성
미성년자남성
미성년자여성
청년남성
중년남성
미성년자여성
청년남성
청년남성
중년남성
청년남성
청년남성
청년남성

TypeError: unsupported operand type(s) for +: 'float' and 'str'

In [28]:
#4.5.1. 5명의 학생의 국어, 영어, 수학 점수를 나타내는 데이터프레임을 다음과 같이 만든다.
#       학생 이름을 나타내는 열을 포함시키지 않고 데이터프레임 df_score1 을 생성한 후, 
#       df_score1.index 속성에 학생 이름을 나타내는 열을 지정하여 인덱스를 지정한다. 
#       reset_index 명령으로 이 인덱스 열을 명령으로 일반 데이터열로 바꾸여 데이터프레임 df_score2을 만든다.
#       학생 이름을 나타내는 열이 일반 데이터 열을 포함하는 데이터프레임 df_score2에 set_index 명령을 적용하여 다시 학생 이름을 나타내는 열을 인덱스로 변경한다.
np.random.seed(2021)
df_score = pd.DataFrame({"name":["CSH","CGE","CMJ","PSH","CJH"],
                        "korean":np.random.uniform(35,100,5).astype(int),
                        "english":np.random.uniform(35,100,5).astype(int),
                        "math":np.random.uniform(35,100,5).astype(int)})
df_score.set_index("name")

      korean  english  math
name
CSH       74       43    41
CGE       82       46    38
CMJ       44       83    97
PSH       55       78    75
CJH       99       85    40

In [171]:
df_score2 = df_score.set_index("name").reset_index()
df_score2

  name  korean  english  math
0  CSH      74       43    41
1  CGE      82       46    38
2  CMJ      44       83    97
3  PSH      55       78    75
4  CJH      99       85    40

In [172]:
df_score2.set_index("name")

      korean  english  math
name
CSH       74       43    41
CGE       82       46    38
CMJ       44       83    97
PSH       55       78    75
CJH       99       85    40